package com.zakhrafa.engine.styles

object Symbols {
    val categories = mapOf(
        "شعبية" to listOf("★", "☆", "✦", "✧", "✩", "✪", "✫", "✬", "✭", "✮", "✯", "✰", "⁂", "⁎", "⁑", "☸", "✢", "✣", "✤", "✥", "✱", "✲", "✳", "✴", "✵", "✶", "✷", "✸", "✹", "✺", "✻", "✼", "✽", "✾", "✿", "❀", "❁", "❂", "❃", "❄", "❅", "❆", "❈", "❉", "❊", "❋"),
        "قلوب" to listOf("♥", "♡", "❤", "❥", "❣", "❦", "❧", "ღ", "❥", "❤", "💔", "❣", "💕", "💞", "💓", "💗", "💖", "💘", "💝", "💟"),
        "وجوه" to listOf("（͡° ͜ʖ ͡°）", "¯\\_(ツ)_/¯", "( ͡° ͜ʖ ͡°)", "ʕ•ᴥ•ʔ", "(▀̿Ĺ̯▀̿ ̿)", "(づ｡◕‿‿•｡)づ", "(ノಠ益ಠ)ノ彡┻━┻", "(•ω•)", "(｡◕‿‿◕｡)", "ᵔᴥ Bear", "ಠ_ಠ"),
        "أسلحة" to listOf("╾━╤デ╦︻", "︻╦̵̵͇̿̿̿̿╤──", "⌐╦╦═─", "︻┳デ═—", "̿̿ ̿̿ ̿̿ ̿'̿'\\̵͇̿̿\\з= ( ▀ ͜ʖ ▀ ) =ε/̵͇̿̿/’̿’̿ ̿ ̿̿ ̿̿ ̿̿", "▄︻̷̿┻̿═━一"),
        "إطارات" to listOf("╰☆☆", "☆☆╮", "·.·★", "★·.·", "ıllıllı", "ıllıllı", "♥*♡∞", "∞♡*♥", "°o.O", "O.o°", "¸,ø¤º", "º¤ø,¸", "◄▲►▼", "▼▲◄►")
    )
}
